YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/b_mcal_nxp_S32K3xx/b_mcal_Base_nxp_S32K3xx/header/S32M27x_GDU_AE.h
/*
** ###################################################################
**     Processor:           S32M27x
**     Compiler:            Keil ARM C/C++ Compiler
**     Reference manual:    S32M27x RM Rev.1
**     Version:             rev. 1.1, 2023-01-03
**     Build:               b230103
**
**     Abstract:
**         Peripheral Access Layer for S32M27x
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2023 NXP
**
**     NXP Confidential. This software is owned or controlled by NXP and may
**     only be used strictly in accordance with the applicable license terms.
**     By expressly accepting such terms or by downloading, installing,
**     activating and/or otherwise using the software, you are agreeing that
**     you have read, and that you agree to comply with and are bound by,
**     such license terms. If you do not agree to be bound by the applicable
**     license terms, then you may not retain, install, activate or otherwise
**     use the software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32M27x_GDU_AE.h
 * @version 1.1
 * @date 2023-01-03
 * @brief Peripheral Access Layer for S32M27x_GDU_AE
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32M27x_GDU_AE_H_)  /* Check if memory map has not been already included */
#define S32M27x_GDU_AE_H_

#include "S32M27x_COMMON.h"

/* ----------------------------------------------------------------------------
   -- GDU_AE Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GDU_AE_Peripheral_Access_Layer GDU_AE Peripheral Access Layer
 * @{
 */

/** GDU_AE - Register Layout Typedef */
typedef struct {
  __IO uint8_t INTF;                               /**< Interrupt Flag, offset: 0x0 */
  uint8_t RESERVED_0[1];
  __IO uint8_t INTEN;                              /**< Interrupt Enable, offset: 0x2 */
  uint8_t RESERVED_1[1];
  __I  uint16_t STAT;                              /**< Status, offset: 0x4 */
  __IO uint16_t CTL;                               /**< Control, offset: 0x6 */
  __IO uint8_t CFG;                                /**< Configuration, offset: 0x8 */
  uint8_t RESERVED_2[1];
  __IO uint8_t EACFG;                              /**< Error Reaction, offset: 0xA */
  uint8_t RESERVED_3[1];
  __IO uint16_t BOOSTCFG;                          /**< Boost, offset: 0xC */
  __IO uint16_t BTCFG;                             /**< Blanking Time, offset: 0xE */
  __IO uint32_t HSSRON;                            /**< High-Side Slew Rate On, offset: 0x10 */
  __IO uint32_t HSSROFF;                           /**< High-Side Slew Rate Off, offset: 0x14 */
  __IO uint32_t LSSRON;                            /**< Low-Side Slew Rate On, offset: 0x18 */
  __IO uint32_t LSSROFF;                           /**< Low-Side Slew Rate Off, offset: 0x1C */
  __IO uint8_t OFFSDCFG;                           /**< Off-State Diagnostic, offset: 0x20 */
  uint8_t RESERVED_4[3];
  __IO uint16_t DSCFG;                             /**< Desaturation Level, offset: 0x24 */
  uint8_t RESERVED_5[2];
  __IO uint32_t CPCFG;                             /**< Charge Pump, offset: 0x28 */
  __I  uint16_t DLYMR;                             /**< Delay Measurement Result, offset: 0x2C */
  __IO uint16_t DLYMCFG;                           /**< Delay Measurement, offset: 0x2E */
  __IO uint8_t SUPCFG;                             /**< Startup Configuration, offset: 0x30 */
  uint8_t RESERVED_6[3];
  __IO uint32_t IRT;                               /**< Iref Trimming, offset: 0x34 */
} GDU_AE_Type, *GDU_AE_MemMapPtr;

/** Number of instances of the GDU_AE module. */
#define GDU_AE_INSTANCE_COUNT                    (1u)

/* GDU_AE - Peripheral instance base addresses */
/** Peripheral GDU_AE base address */
#define IP_GDU_AE_BASE                           (0x180u)
/** Peripheral GDU_AE base pointer */
#define IP_GDU_AE                                ((GDU_AE_Type *)IP_GDU_AE_BASE)
/** Array initializer of GDU_AE peripheral base addresses */
#define IP_GDU_AE_BASE_ADDRS                     { IP_GDU_AE_BASE }
/** Array initializer of GDU_AE peripheral base pointers */
#define IP_GDU_AE_BASE_PTRS                      { IP_GDU_AE }

/* ----------------------------------------------------------------------------
   -- GDU_AE Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GDU_AE_Register_Masks GDU_AE Register Masks
 * @{
 */

