YUNSUNGWOONG/rtu_S32K312_R44-24.07.1_R240724_ARMGCC/Static_Code/Modules/b_mcal_nxp_S32K3xx/b_mcal_Base_nxp_S32K3xx/header/S32M27x_GDU_AE.h
/*! @name INTF - Interrupt Flag */
/*! @{ */

#define GDU_AE_INTF_DLSIF0_MASK                  (0x1U)
#define GDU_AE_INTF_DLSIF0_SHIFT                 (0U)
#define GDU_AE_INTF_DLSIF0_WIDTH                 (1U)
#define GDU_AE_INTF_DLSIF0(x)                    (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTF_DLSIF0_SHIFT)) & GDU_AE_INTF_DLSIF0_MASK)

#define GDU_AE_INTF_DLSIF1_MASK                  (0x2U)
#define GDU_AE_INTF_DLSIF1_SHIFT                 (1U)
#define GDU_AE_INTF_DLSIF1_WIDTH                 (1U)
#define GDU_AE_INTF_DLSIF1(x)                    (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTF_DLSIF1_SHIFT)) & GDU_AE_INTF_DLSIF1_MASK)

#define GDU_AE_INTF_DLSIF2_MASK                  (0x4U)
#define GDU_AE_INTF_DLSIF2_SHIFT                 (2U)
#define GDU_AE_INTF_DLSIF2_WIDTH                 (1U)
#define GDU_AE_INTF_DLSIF2(x)                    (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTF_DLSIF2_SHIFT)) & GDU_AE_INTF_DLSIF2_MASK)

#define GDU_AE_INTF_DHSIF0_MASK                  (0x10U)
#define GDU_AE_INTF_DHSIF0_SHIFT                 (4U)
#define GDU_AE_INTF_DHSIF0_WIDTH                 (1U)
#define GDU_AE_INTF_DHSIF0(x)                    (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTF_DHSIF0_SHIFT)) & GDU_AE_INTF_DHSIF0_MASK)

#define GDU_AE_INTF_DHSIF1_MASK                  (0x20U)
#define GDU_AE_INTF_DHSIF1_SHIFT                 (5U)
#define GDU_AE_INTF_DHSIF1_WIDTH                 (1U)
#define GDU_AE_INTF_DHSIF1(x)                    (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTF_DHSIF1_SHIFT)) & GDU_AE_INTF_DHSIF1_MASK)

#define GDU_AE_INTF_DHSIF2_MASK                  (0x40U)
#define GDU_AE_INTF_DHSIF2_SHIFT                 (6U)
#define GDU_AE_INTF_DHSIF2_WIDTH                 (1U)
#define GDU_AE_INTF_DHSIF2(x)                    (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTF_DHSIF2_SHIFT)) & GDU_AE_INTF_DHSIF2_MASK)

#define GDU_AE_INTF_HDHVDIF_MASK                 (0x80U)
#define GDU_AE_INTF_HDHVDIF_SHIFT                (7U)
#define GDU_AE_INTF_HDHVDIF_WIDTH                (1U)
#define GDU_AE_INTF_HDHVDIF(x)                   (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTF_HDHVDIF_SHIFT)) & GDU_AE_INTF_HDHVDIF_MASK)
/*! @} */

/*! @name INTEN - Interrupt Enable */
/*! @{ */

#define GDU_AE_INTEN_DLSIE0_MASK                 (0x1U)
#define GDU_AE_INTEN_DLSIE0_SHIFT                (0U)
#define GDU_AE_INTEN_DLSIE0_WIDTH                (1U)
#define GDU_AE_INTEN_DLSIE0(x)                   (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTEN_DLSIE0_SHIFT)) & GDU_AE_INTEN_DLSIE0_MASK)

#define GDU_AE_INTEN_DLSIE1_MASK                 (0x2U)
#define GDU_AE_INTEN_DLSIE1_SHIFT                (1U)
#define GDU_AE_INTEN_DLSIE1_WIDTH                (1U)
#define GDU_AE_INTEN_DLSIE1(x)                   (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTEN_DLSIE1_SHIFT)) & GDU_AE_INTEN_DLSIE1_MASK)

#define GDU_AE_INTEN_DLSIE2_MASK                 (0x4U)
#define GDU_AE_INTEN_DLSIE2_SHIFT                (2U)
#define GDU_AE_INTEN_DLSIE2_WIDTH                (1U)
#define GDU_AE_INTEN_DLSIE2(x)                   (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTEN_DLSIE2_SHIFT)) & GDU_AE_INTEN_DLSIE2_MASK)

#define GDU_AE_INTEN_DHSIE0_MASK                 (0x10U)
#define GDU_AE_INTEN_DHSIE0_SHIFT                (4U)
#define GDU_AE_INTEN_DHSIE0_WIDTH                (1U)
#define GDU_AE_INTEN_DHSIE0(x)                   (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTEN_DHSIE0_SHIFT)) & GDU_AE_INTEN_DHSIE0_MASK)

#define GDU_AE_INTEN_DHSIE1_MASK                 (0x20U)
#define GDU_AE_INTEN_DHSIE1_SHIFT                (5U)
#define GDU_AE_INTEN_DHSIE1_WIDTH                (1U)
#define GDU_AE_INTEN_DHSIE1(x)                   (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTEN_DHSIE1_SHIFT)) & GDU_AE_INTEN_DHSIE1_MASK)

#define GDU_AE_INTEN_DHSIE2_MASK                 (0x40U)
#define GDU_AE_INTEN_DHSIE2_SHIFT                (6U)
#define GDU_AE_INTEN_DHSIE2_WIDTH                (1U)
#define GDU_AE_INTEN_DHSIE2(x)                   (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTEN_DHSIE2_SHIFT)) & GDU_AE_INTEN_DHSIE2_MASK)

#define GDU_AE_INTEN_HDHVDIE_MASK                (0x80U)
#define GDU_AE_INTEN_HDHVDIE_SHIFT               (7U)
#define GDU_AE_INTEN_HDHVDIE_WIDTH               (1U)
#define GDU_AE_INTEN_HDHVDIE(x)                  (((uint8_t)(((uint8_t)(x)) << GDU_AE_INTEN_HDHVDIE_SHIFT)) & GDU_AE_INTEN_HDHVDIE_MASK)
/*! @} */

/*! @name STAT - Status */
/*! @{ */

#define GDU_AE_STAT_DLSES0_MASK                  (0x1U)
#define GDU_AE_STAT_DLSES0_SHIFT                 (0U)
#define GDU_AE_STAT_DLSES0_WIDTH                 (1U)
#define GDU_AE_STAT_DLSES0(x)                    (((uint16_t)(((uint16_t)(x)) << GDU_AE_STAT_DLSES0_SHIFT)) & GDU_AE_STAT_DLSES0_MASK)

#define GDU_AE_STAT_DLSES1_MASK                  (0x2U)
#define GDU_AE_STAT_DLSES1_SHIFT                 (1U)
#define GDU_AE_STAT_DLSES1_WIDTH                 (1U)
#define GDU_AE_STAT_DLSES1(x)                    (((uint16_t)(((uint16_t)(x)) << GDU_AE_STAT_DLSES1_SHIFT)) & GDU_AE_STAT_DLSES1_MASK)

#define GDU_AE_STAT_DLSES2_MASK                  (0x4U)
#define GDU_AE_STAT_DLSES2_SHIFT                 (2U)
#define GDU_AE_STAT_DLSES2_WIDTH                 (1U)
#define GDU_AE_STAT_DLSES2(x)                    (((uint16_t)(((uint16_t)(x)) << GDU_AE_STAT_DLSES2_SHIFT)) & GDU_AE_STAT_DLSES2_MASK)

#define GDU_AE_STAT_DHSES0_MASK                  (0x10U)
#define GDU_AE_STAT_DHSES0_SHIFT                 (4U)
#define GDU_AE_STAT_DHSES0_WIDTH                 (1U)
#define GDU_AE_STAT_DHSES0(x)                    (((uint16_t)(((uint16_t)(x)) << GDU_AE_STAT_DHSES0_SHIFT)) & GDU_AE_STAT_DHSES0_MASK)

#define GDU_AE_STAT_DHSES1_MASK                  (0x20U)
#define GDU_AE_STAT_DHSES1_SHIFT                 (5U)
#define GDU_AE_STAT_DHSES1_WIDTH                 (1U)
#define GDU_AE_STAT_DHSES1(x)                    (((uint16_t)(((uint16_t)(x)) << GDU_AE_STAT_DHSES1_SHIFT)) & GDU_AE_STAT_DHSES1_MASK)

#define GDU_AE_STAT_DHSES2_MASK                  (0x40U)
#define GDU_AE_STAT_DHSES2_SHIFT                 (6U)
#define GDU_AE_STAT_DHSES2_WIDTH                 (1U)
#define GDU_AE_STAT_DHSES2(x)                    (((uint16_t)(((uint16_t)(x)) << GDU_AE_STAT_DHSES2_SHIFT)) & GDU_AE_STAT_DHSES2_MASK)

#define GDU_AE_STAT_HDHVDS_MASK                  (0x80U)
#define GDU_AE_STAT_HDHVDS_SHIFT                 (7U)
#define GDU_AE_STAT_HDHVDS_WIDTH                 (1U)
#define GDU_AE_STAT_HDHVDS(x)                    (((uint16_t)(((uint16_t)(x)) << GDU_AE_STAT_HDHVDS_SHIFT)) & GDU_AE_STAT_HDHVDS_MASK)
/*! @} */

/*! @name CTL - Control */
/*! @{ */

#define GDU_AE_CTL_GDUEN_MASK                    (0x1U)
#define GDU_AE_CTL_GDUEN_SHIFT                   (0U)
#define GDU_AE_CTL_GDUEN_WIDTH                   (1U)
#define GDU_AE_CTL_GDUEN(x)                      (((uint16_t)(((uint16_t)(x)) << GDU_AE_CTL_GDUEN_SHIFT)) & GDU_AE_CTL_GDUEN_MASK)

#define GDU_AE_CTL_CPEN_MASK                     (0x2U)
#define GDU_AE_CTL_CPEN_SHIFT                    (1U)
#define GDU_AE_CTL_CPEN_WIDTH                    (1U)
#define GDU_AE_CTL_CPEN(x)                       (((uint16_t)(((uint16_t)(x)) << GDU_AE_CTL_CPEN_SHIFT)) & GDU_AE_CTL_CPEN_MASK)

